[M_IrisHUB_MatterOfTaste MissionDefinition]
MissionName="A matter of taste"
MissionDescription="There are people who want to criticize him [place]Renvog South[-place] He published negative reviews about some gentlemen. And with great anger said about the field, you go to Allah [place]Renvog South[-place] and kill visitors in their name."
TurnInDescription="In Torg's defense, it's true that Diamond Task 2 is cheap."
MissionSummary="Press web server ECHO to Mr. Targ."
MissionGiver="Crater Award Committee"
MissionTurnInLocation="Dahana Award Committee"
TeaserText="Get ready for a thrilling battle.."

[M_IrisHUB_MatterOfTaste:DefeatOtherReviewer MissionObjectiveDefinition]
ProgressMessage="Kill the judge"

[M_IrisHUB_MatterOfTaste:DefeatWave1 MissionObjectiveDefinition]
ProgressMessage="The ECHO Network received critical acclaim"

[M_IrisHUB_MatterOfTaste:DefeatWave2 MissionObjectiveDefinition]
ProgressMessage="Kill all the animals on the Echo Network."

[M_IrisHUB_MatterOfTaste:FindReviewer MissionObjectiveDefinition]
ProgressMessage="Look for Ma Q"

[M_IrisHUB_MatterOfTaste:KillReviewer MissionObjectiveDefinition]
ProgressMessage="Kill Mazau."

[M_IrisHUB_MatterOfTaste:MissionObjectiveSetDefinition_3 MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_IrisHUB_MatterOfTaste:MissionObjectiveSetDefinition_4 MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_IrisHUB_MatterOfTaste:MissionObjectiveSetDefinition_5 MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_IrisHUB_MatterOfTaste:MissionObjectiveSetDefinition_6 MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_IrisHUB_MatterOfTaste:ReturnToBoard MissionObjectiveDefinition]
ProgressMessage="back to the tree"

